{"id":7166,"date":"2019-12-27T16:07:00","date_gmt":"2019-12-27T10:37:00","guid":{"rendered":"https:\/\/greedygame.com\/?p=7166"},"modified":"2019-12-30T18:38:28","modified_gmt":"2019-12-30T13:08:28","slug":"ccpa","status":"publish","type":"post","link":"https:\/\/greedygame.com\/post\/ccpa\/","title":{"rendered":"Introduction to CCPA compliance norms"},"content":{"rendered":"<p itemprop=\"description\"><span>In late June, 2018, California passed a <\/span><a href=\"https:\/\/leginfo.legislature.ca.gov\/faces\/billTextClient.xhtml?bill_id=201720180AB375\" rel=\"noopener nofollow noreferrer\" target=\"_blank\">consumer privacy act<\/a><span>, AB 375, that could have more repercussions on U.S. companies than the European Union’s <\/span><a href=\"https:\/\/www.csoonline.com\/article\/3202771\/data-protection\/general-data-protection-regulation-gdpr-requirements-deadlines-and-facts.html\">General Data Protection Regulation (GDPR)<\/a><span> that went into effect this past spring. The California law doesn&#8217;t have some of GDPR&#8217;s most onerous requirements, such as the narrow 72-hour window in which a company must report a breach. In other respects, however, it goes even farther.<\/span><\/p>\n<p itemprop=\"description\"><span>The California Consumer Privacy Act (CCPA) takes a broader view than the GDPR of what constitutes private data. The challenge for security, then, is to locate and secure that private data.<\/span><\/p>\n<p itemprop=\"description\">\n<h2>What is the CCPA?<\/h2>\n<p>AB 375 allows any California consumer to demand to see all the information a company has saved on them, as well as a full list of all the third parties that data is shared with. In addition, the California law allows consumers to sue companies if the privacy guidelines are violated, even if there is no breach.<\/p>\n<p>&nbsp;<\/p>\n<h2>Which companies does the CCPA affect?<\/h2>\n<p>All companies that serve California residents and have at least $25 million in annual revenue must comply with the law. In addition, companies of any size that have personal data on at least 50,000 people or that collect more than half of their revenues from the sale of personal data, also fall under the law. Companies don&#8217;t have to be based in California or have a physical presence there to fall under the law. They don&#8217;t even have to be based in the United States.<\/p>\n<p>An amendment made in April exempts “insurance institutions, agents, and support organizations” as they are already subject to similar regulations under California’s Insurance Information and Privacy Protection Act (IIPPA).<\/p>\n<p>&nbsp;<\/p>\n<h2>When does my company need to comply with the CCPA?<\/h2>\n<p>The law goes into effect on January 1, 2020. As a practical matter, companies need to have their data tracking systems in place by the start of 2019, since it gives consumers the right to request all the data a company has collected on them over the previous 12 months. That&#8217;s a very tight timeframe.<\/p>\n<p>&nbsp;<\/p>\n<h2>What happens if my company is not in compliance with the CCPA?<\/h2>\n<p>Companies have 30 days to comply with the law once regulators notify them of a violation. If the issue isn&#8217;t resolved, there&#8217;s a fine of up to $7,500 per record. &#8220;If you think about how many records are affected in a breach, it really increases very quickly,&#8221; says Debra Farber, senior director for privacy strategy at BigID. Since the bill was put together and passed in just a week, it will probably see some amendments, she adds. &#8220;Things like the fine amounts are likely to change.&#8221;<\/p>\n<p>There&#8217;s also another potential financial risk, Farber says. &#8220;The bill provides for an individual&#8217;s right to sue, for the first time &#8221; she says. &#8220;And it allows class action lawsuits for damages.&#8221;<\/p>\n<p>Again, there&#8217;s a 30-day window that starts when the consumers give written notice to a company that they believe their privacy rights have been violated. &#8220;If it&#8217;s not cured, and the attorney general declines to prosecute, then they can bring a class action suit,&#8221; Farber says. &#8220;And it&#8217;s not just around breaches.&#8221;<\/p>\n<p>For example, the law specifies that companies must have a clearly visible footer on websites offering consumers the option to opt out of data sharing. If that footer is missing, consumers can sue. They can also sue if they can&#8217;t find out how their information has been collected or get copies of that information. “It can be around anything,&#8221; Farber says.<\/p>\n<p>The law assigns specific penalties should unauthorized access occur, whether through a breach, exfiltration, theft, or “disclosure as a result of the business’ violation of the duty to implement and maintain reasonable security procedures and practices,” As currently written, AB 375 allows for penalties of $100 to $750 per consumer per incident, or actual damages, whichever is greater.<\/p>\n<aside class=\"nativo-promo nativo-promo-2 tablet desktop smartphone\"><\/aside>\n<p>&#8220;Add in all the other breach related costs &#8212; IT response, forensics and recovery, legal, notification, and so on &#8212; and this could push a breach into the realm of an existential threat to many businesses,&#8221; says Chris Prevost, head of runtime security solutions architecture at Imperva.<\/p>\n<p>In general, if a company took the steps needed to comply with the GDPR, then it&#8217;s most of the way there for the California Consumer Privacy Act. At least, it&#8217;s closer than if it isn&#8217;t ready for GDPR, says Eric Dieterich, data privacy practice leader at Focal Point Data Risk, LLC. &#8220;Some multinationals made changes for their European markets, but maybe didn&#8217;t roll it out to U.S.-based activities, so there might be a scoping change,&#8221; he says.<\/p>\n<p>&nbsp;<\/p>\n<h2>What data does the CCPA cover?<\/h2>\n<p>The California law takes a broader approach to what constitutes sensitive data than the GDPR. For example, olfactory information is covered, as well as browsing history and records of a visitor&#8217;s interactions with a website or application. Here’s what AB 375 considers “personal information”:<\/p>\n<ul>\n<li>Identifiers such as a real name, alias, postal address, unique personal identifier, online identifier IP address, email address, account name, Social Security number, driver’s license number, passport number, or other similar identifiers<\/li>\n<li>Characteristics of protected classifications under California or federal law<\/li>\n<li>Commercial information including records of personal property, products or services purchased, obtained or considered, or other purchasing or consuming histories or tendencies<\/li>\n<li>Biometric information<\/li>\n<li>Internet or other electronic network activity information including, but not limited to, browsing history, search history and information regarding a consumer’s interaction with a website, application or advertisement<\/li>\n<li>Geolocation data<\/li>\n<li>Audio, electronic, visual, thermal, olfactory or similar information<\/li>\n<li>Professional or employment-related information<\/li>\n<li>Education information, defined as information that is not publicly available personally identifiable information (PII) as defined in the Family Educational Rights and Privacy Act (20 U.S.C. section 1232g, 34 C.F.R. Part 99)<\/li>\n<li>Inferences drawn from any of the information identified in this subdivision to create a profile about a consumer reflecting the consumer’s preferences, characteristics, psychological trends, preferences, predispositions, behavior, attitudes, intelligence, abilities and aptitudes<\/li>\n<\/ul>\n<p>An amendment, AB 874, currently awaiting the governor&#8217;s signature would exempt publicly available, deidentified and aggregate consumer information from being classified as PII. Publicly available information is defined as data available and maintained from government records.<\/p>\n<p>The CCPA originally covered employee as well as consumer data. An amendment passed in April, however, exempts employee data from the regulation. Another amendment, AB 25, partially exempts personal information collected from job applicants, owners, directors, officers, medical staff, and contractors. This exemption would expire on January 1, 2021. AB 25 was awaiting the governor&#8217;s signature at this writing.<\/p>\n<h2><\/h2>\n<h2>What are the key privacy provisions in the CCPA?<\/h2>\n<p>Companies must allow consumers to choose not to have their data shared with third parties. That means that companies will now have to be able to separate the data they collect according to the users&#8217; privacy choices.<\/p>\n<p>In addition, while a company cannot refuse users equal service, it can offer incentives to users who provide personal information. &#8220;This provision might be subject to change, but as stated today, it gives you the ability to offer discounts to people who are willing to have their data shared or sold to third parties,&#8221; says Dieterich. &#8220;Traditionally, systems aren&#8217;t designed so that your pricing structure might change depending on your privacy choices. That&#8217;s a new concept that has very technical implications.&#8221;<\/p>\n<p>Another major difference with GDPR is that the California law allows customers much greater access to their records, says Subra Ramesh, SVP of products at Dataguise. A California consumer has the right to find out what information a company collects about them. Most companies are going to have trouble pulling that information together. &#8220;First, the amount of data they collect is already massive and continues to grow, often in the hundreds to thousands worth of terabytes, and with enterprise-level organizations processing petabytes of data,&#8221; he says.<\/p>\n<p>That data is contained in multiple storage platforms, in different file times. &#8220;Most file search tools lack the ability to search across the modern file repository ecosystems so prevalent today,” says Aaron Ganek, CEO of Cloudtenna.  “Cross-silo file management is a major challenge. It is difficult to understand context for each file if they are scattered inside different repositories.&#8221; Plus, compliance issues are associated with pulling together data, he says. &#8220;Legacy enterprise tools struggle to observe the disparate permissions and security models, violating the very laws and regulations they’re being used to satisfy.”<\/p>\n<p>Then there&#8217;s the time limit. &#8220;After the access request, a company has 45 days to provide them a comprehensive report about what type of information they have, was it sold, and to whom, and if it was sold to third parties over the past 12 months, it must give the names and addresses of the third parties the data is sold to,&#8221; says John Tsopanis, privacy product manager at 1touch.io. &#8220;You can&#8217;t do that in Europe.&#8221;<\/p>\n<p>Since the rule covers the previous 12 months of records, companies have to start complying six months from now, he says. Then, on January 1, 2020, every company has to disclose every other company they sell data to. &#8220;It will change the privacy landscape in America forever,&#8221; Tsopanis says.<\/p>\n<h2><\/h2>\n<h2>What does the CCPA mean for security?<\/h2>\n<p>AB 375 is light on requirements around security and breach response when compared to the GDPR. As stated earlier, the law does define penalties for companies that expose consumer data due to a breach or security lapse. It also allows courts to offer “injunctive or declaratory relief,” or “any other relief the court deems proper.”<\/p>\n<p>Businesses are not required to report breaches under AB 375, and consumers must file complaints before fines are possible. The best course of action for security, then, is to know what data AB 375 defines as private data and take steps to secrure it. Again, any organization that complies with the GDPR likely does not need to take further action to comply with AB 375 in terms of securing data.<\/p>\n<p>The AB 375 requirements around tracking, accessing, and storing data mean security teams will need to work closely with database administrators, says Terry Ray, senior vice president and fellow at Imperva, a cybersecurity vendor. Any tools selected to help deal with AB 375 will not only need to have full visibility into data stored across the entire heterogenous corporate environment, but also ensure that access to this data is properly secured. &#8220;Lastly, they will need these tools to cooperate with the new consumer portal by sharing specific consumer data with the verifiable consumer requesting it,&#8221; he says.<\/p>\n<p>If the data is stored with cloud providers, the problem just gets worse. For example, employees might set up a file-sharing account to keep track of marketing or sales contacts. &#8220;It’s not surprising the large tech companies like Google and Facebook opposed the bill,&#8221; says Kevin Bocek, VP of security strategy and threat intelligence at Venafi. &#8220;Controlling the privacy and personal information that flows between machines is incredibly difficult, and a major challenge for all businesses.&#8221;<\/p>\n<h2><\/h2>\n<h2>A work in progress<\/h2>\n<p>The bill was put together in just seven days because legislators wanted to avoid a ballot initiative to pass an even stricter law that was opposed by many tech companies. &#8220;Right now, many of the provisions and definitions conflict with one another,&#8221; says Andy Dale, general counsel and VP of global privacy at SessionM. &#8220;The law becomes effective in 2020, so expect amendments between now and implementation &#8212; but the core tenets and rights are likely to remain.&#8221;<\/p>\n<p>One problematic area is whether a company can charge consumers different prices based on their privacy settings. For example, many companies have an option where a consumer can upgrade to a paid tier where they don&#8217;t see any ads. Here, the law as currently written is a little bit contradictory.<\/p>\n<p>&#8220;If the consumer exercises his rights under the regulation, businesses cannot provide a different level or quality of product, goods or services to the consumer,&#8221; says Pravin Kothari, CEO of CipherCloud. &#8220;On the other side of the coin, according to the regulation, businesses are not prohibited from charging a consumer a different price or rate, or from providing a different level or quality of goods or services to the consumer, if that difference is reasonably related to the value provided to the consumer by the consumer’s data.&#8221;<\/p>\n<p>It looks like California is trying to define a framework where consumers can get paid for sharing their data, Kothari says. &#8220;In this area the legislation is a bit visionary,&#8221; he says. &#8220;We&#8217;ll see in practice how this actually works out.&#8221;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In late June, 2018, California passed a consumer privacy act, AB 375, that could have more repercussions on U.S. companies than the European Union’s General Data Protection Regulation (GDPR) that went into effect this past spring. The California law doesn&#8217;t have some of GDPR&#8217;s most onerous requirements, such as the narrow 72-hour window in which a company must [&hellip;]<\/p>\n","protected":false},"author":173546090,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"advanced_seo_description":"","_coblocks_attr":"","_coblocks_dimensions":"","_coblocks_responsive_height":"","_coblocks_accordion_ie_support":"","spay_email":""},"categories":[1],"tags":[],"jetpack_featured_media_url":"","yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.5 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Introduction to CCPA compliance norms - GreedyGame<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/greedygame.com\/post\/ccpa\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Introduction to CCPA compliance norms - GreedyGame\" \/>\n<meta property=\"og:description\" content=\"In late June, 2018, California passed a consumer privacy act, AB 375, that could have more repercussions on U.S. companies than the European Union’s General Data Protection Regulation (GDPR) that went into effect this past spring. The California law doesn&#8217;t have some of GDPR&#8217;s most onerous requirements, such as the narrow 72-hour window in which a company must [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/greedygame.com\/post\/ccpa\/\" \/>\n<meta property=\"og:site_name\" content=\"GreedyGame\" \/>\n<meta property=\"article:published_time\" content=\"2019-12-27T10:37:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-12-30T13:08:28+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"8 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/greedygame.com\/#website\",\"url\":\"https:\/\/greedygame.com\/\",\"name\":\"GreedyGame\",\"description\":\"Automation Tool for Admob\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/greedygame.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/greedygame.com\/post\/ccpa\/#webpage\",\"url\":\"https:\/\/greedygame.com\/post\/ccpa\/\",\"name\":\"Introduction to CCPA compliance norms - GreedyGame\",\"isPartOf\":{\"@id\":\"https:\/\/greedygame.com\/#website\"},\"datePublished\":\"2019-12-27T10:37:00+00:00\",\"dateModified\":\"2019-12-30T13:08:28+00:00\",\"author\":{\"@id\":\"https:\/\/greedygame.com\/#\/schema\/person\/2cb5d8c5b9d40bc53e3a036f49559d12\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/greedygame.com\/post\/ccpa\/\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/greedygame.com\/#\/schema\/person\/2cb5d8c5b9d40bc53e3a036f49559d12\",\"name\":\"Bhisham Vashistha\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/greedygame.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/38fe245177ca561dd7b7f29d8b04cfff?s=96&d=monsterid&r=g\",\"caption\":\"Bhisham Vashistha\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_shortlink":"https:\/\/wp.me\/sbnzzl-ccpa","_links":{"self":[{"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/posts\/7166"}],"collection":[{"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/users\/173546090"}],"replies":[{"embeddable":true,"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/comments?post=7166"}],"version-history":[{"count":9,"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/posts\/7166\/revisions"}],"predecessor-version":[{"id":7203,"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/posts\/7166\/revisions\/7203"}],"wp:attachment":[{"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/media?parent=7166"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/categories?post=7166"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/tags?post=7166"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}