{"id":1135,"date":"2019-11-04T11:38:19","date_gmt":"2019-11-04T11:38:19","guid":{"rendered":"http:\/\/dev107.developit.hu\/?page_id=1135"},"modified":"2019-11-26T17:01:52","modified_gmt":"2019-11-26T11:31:52","slug":"terms-of-services","status":"publish","type":"page","link":"https:\/\/greedygame.com\/terms-of-services\/","title":{"rendered":"Terms of services"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-page\" data-elementor-id=\"1135\" class=\"elementor elementor-1135\" data-elementor-settings=\"[]\">\n\t\t\t\t\t\t<div class=\"elementor-inner\">\n\t\t\t\t\t\t\t<div class=\"elementor-section-wrap\">\n\t\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-d6f079b elementor-section-stretched elementor-section-full_width elementor-section-height-default elementor-section-height-default\" data-id=\"d6f079b\" data-element_type=\"section\" data-settings=\"{&quot;stretch_section&quot;:&quot;section-stretched&quot;,&quot;background_background&quot;:&quot;classic&quot;}\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t\t\t<div class=\"elementor-row\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-f89ef83\" data-id=\"f89ef83\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-column-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t<div class=\"elementor-widget-wrap\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-ea36e78 privacy-title elementor-widget elementor-widget-text-editor\" data-id=\"ea36e78\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t<div class=\"elementor-text-editor elementor-clearfix\"><h3 style=\"text-align: center;\"><span style=\"font-weight: normal;\">Terms of Service<\/span><\/h3><\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-47f1e29 elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"47f1e29\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t\t\t<div class=\"elementor-row\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-87151ba\" data-id=\"87151ba\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-column-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t<div class=\"elementor-widget-wrap\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-185307b elementor-widget elementor-widget-text-editor\" data-id=\"185307b\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t<div class=\"elementor-text-editor elementor-clearfix\"><p>This GreedyGame Terms of Service (“Agreement”) entered by and between GreedyGame Media Pvt. Ltd. (“GG”), a company incorporated under the Companies Act, 2013 having its registered office at A-486\/487, Indira Gali, Mandavali, Delhi – 110092 and You (“Publisher”), i.e. you or any other person or entity identified in any Service account on whose behalf you are authorized to act, constitutes the terms and conditions for Your use of the GreedyGame advertising technology.<\/p><p>By creating any Service account via the online user interface provided by GreedyGame for accessing its services, or by otherwise accessing or using any of the Services, You agree that You have the authority to bind and You agree to be bound by the terms of this Agreement. If You do not agree to the terms of this Agreement, do not create a Service account, or access or use any Service. This Agreement does not alter in any way the terms or conditions of any other agreement You may have with GreedyGame for products, services or otherwise.<\/p><p>Now, therefore in consideration of the mutual promises contained herein, and for other good and valuable consideration, the receipt and sufficiency of which are hereby acknowledged, GG and Publisher are each a “Party” and, collectively, the “Parties”. The Parties hereby agree as follows:<\/p><ol><li><strong> Definitions<\/strong><\/li><\/ol><p>All capitalized terms used in the Agreement and any exhibit attached to the Agreement have the meaning set forth below. All definitions shall apply both to their singular or plural forms, as the context may require.<\/p><p>“Action” means any activity defined by the Advertiser as a result of gamer interaction within the engagement window.<\/p><p>“Ad Units” means the Network units or graphical elements allowed by Publisher where Ads can be incorporated by GG. These may include splash screens, powerups, obstacles, backgrounds, objects, characters and any other unit within the game which the Publisher can allow to put advertisement textures on.<\/p><p>“Advertiser” means any advertiser, advertising agency, sponsor, promotional partner, media buying service or other similar entity that, whether directly or through its advertising agency, promotes itself, its brands or its products or services.<\/p><p>“Advertising,” “Advertisements” or “Ads” means the pixel advertisements sold by Publisher for display on its Networks that promote a brand or a product or a service through change of backgrounds, splash screens, character changes, powerup changes, obstacle changes, push notifications, buttons and similar promotional devices as well as all elements of a sponsorship or promotion.<\/p><p>“Advertising Sales Revenue” means any and all gross consideration accrued by GG in connection with Advertising that relates to the publisher’s Network, including, without limitation, any and all invoiced amounts, broker and other commissions, secondary and performance payments, bonuses, barter agreements and revenues, and refunds, allowances and all other additional accrued amounts excluding taxes if any<\/p><p>“Agreement” means this Agreement and any exhibits and schedules attached hereto, as the same may be amended, supplemented or modified in accordance with the terms hereof.<\/p><p>“Confidential Information” shall have the meaning set forth in Section 6.1.<\/p><p>“Content” means a Party’s proprietary images, video, audio, documents, customer information, data or other content, in any media and format, and any intellectual property rights relating to any of the foregoing, made available by or on behalf of a Party for use in relation to the Services.<\/p><p>“CPM” means the United States Dollar cost per 1000 impressions with respect to Advertising sold by GG to an Advertiser.<\/p><p>“Consulting Fee” is defined as set forth in Section 4.1 of this Agreement.<\/p><p>“Gross Revenue” means all revenue generated from Advertisers for Advertisements sold by GG and served on the Network, excluding taxes if any.<\/p><p>“Laws” means applicable laws, rules and regulations, including without limitation, local and national laws, rules and regulations, treaties, voluntary industry standards (if any), and other legal obligations pertaining to the this Agreement and\/or to any of Publisher’s activities under this Agreement, including without limitation, those applicable to any tax, consumer and\/or product safety, data privacy and the privacy and protection of personally identifiable information, the protection of minors, employees, and the environment, the United States Foreign Corrupt Practices Act of 1977 and any amendments thereto (and any local or foreign equivalent), the UK Bribery Act 2010, and the provision of services.<\/p><p>“Marks” means the service names, service marks, trade names and trademarks of a Party hereto.<\/p><p>“Net Advertising Sales Revenue” means Gross Revenue less (i) advertising serving and sales commissions costs; (iii) and any refunds, credits or amounts written off by GG as bad debt however all of which shall not be more than 15% (fifteen percent) of the Advertising Sales Revenue excluding taxes if any<\/p><p>“Network” or “Networks” means the designated web sites and the internet web sites, mobile wap sites, applications, games, wap portals owned and\/or operated by Publisher.<\/p><p>“Online Interface” means GG’s online interface to report ad revenue, pricing and other relevant information of every ad unit and additional tools to enable Publisher to proactively monitor performance of the network as well as view and update invoicing related documents.<\/p><p>“Publisher Entity” means Publisher and its officers, directors, parent, affiliated companies, information Publishers, licensors, licensees, employees, agents, attorneys, consultants, contractors, network members or third-party service Publishers or their respective officers, directors, employees, affiliated companies or agents.<\/p><p>“Renewal Term” shall have the meaning set forth in Section 5.1.<\/p><p>“Systems” means a Party’s proprietary technology, methods of operation, processes, procedures, ideas and concepts, interfaces, protocols, formats, specifications or other similar materials, software, hardware, code or any other functional item, and any intellectual property rights relating to any of the foregoing.<\/p><p>“Term” means the term of this Agreement, as set forth in Section 5.1.<\/p><ol start=\"2\"><li><strong> Obligations of Publisher<\/strong><\/li><\/ol><p>2.1. Appointment<\/p><p>Publisher is a partner and hereby grants to GG the right, licenses and privilege to sell Advertising to be displayed on the Publisher’s Network within geographies and clients agreed with the publisher.<\/p><p>Publisher will cooperate with GG in the establishment of Advertising rates, notwithstanding the foregoing; Publisher may, in its sole and absolute discretion, set a minimum CPM rate.<\/p><p>Publisher will provide GG with certain necessary and commercially reasonable sales and marketing resources reasonably required to support new advertising recommendations and demonstrations for soliciting ad sales for the Network. For example, this may include DAU figures, demographic information.<\/p><p>Publisher grants to GG the right to use the Publisher’s logo on GG’s website and also to use the Publisher’s game screenshots as a marketing resource.<\/p><p>Publisher may only reject and block categories of advertising content showcased by GG on its network. Publisher understands that it may take upto 48 hours to completely paused the ads from the blocked category once the request is made to GG.<\/p><p> 2.2. Restrictions on Publisher Network Content and Operations<\/p><p>Publisher will not include or provide via the Networks any material that is or may be considered: (a) libelous, pornographic, obscene, or defamatory under any applicable law or in any jurisdiction in which a user resides; (b) an infringement of any third party’s intellectual property rights (including copyright, patent, trademark, trade secret or other proprietary rights); (c) an infringement on any third party’s rights of publicity or privacy; or (d) contain any viruses or other computer programming routines that are intended to damage, detrimentally interfere with, surreptitiously intercept or expropriate any system, data or personal information.<\/p><p> 2.3. Placement and Use of Ad Units<\/p><p>Publisher will install the GG software on the Networks in such a manner as to assure that the Advertising to be delivered as well as fully and clearly visible on the Network. Publisher will abide by GG’s reasonable technical approval process for Ad Asset identification or additional placements so long as Publisher has been given reasonable and specific notice thereof in writing.<\/p><p> 2.4. Access to Publisher Network Information<\/p><p>Publisher will furnish to GG any web\/wap analytics information regarding the Networks and the Networks’ apps (“Reports”) as is reasonably requested by GG. GG assures this information will only be used for the sale of Advertising on the Network.<\/p><p>2.5. Compliance with Privacy Laws<\/p><p>Publisher will prominently place on its Networks, and operate in accordance and compliance with, a privacy statement or policy that adheres to or exceeds the requirements of applicable law. Publisher will comply, and contractually require any third party, including Advertisers, within the Publisher Network (as applicable) to comply, with GreedyGame Privacy Policy (can be found at <a href=\"https:\/\/www.greedygame.com\/privacy-policy\" rel=\"nofollow\">https:\/\/www.greedygame.com\/privacy-policy<\/a>), which may be updated by GreedyGame from time to time.<\/p><p> 2.6. Consent<\/p><p>Publishers must provide visible notice to, and where necessary, obtain legally sufficient consent from, their users regarding the scope of collection, use, sharing, or other processing of data by GreedyGame for personalized advertising purposes, including, for example, device identifiers, location information, and demographic and interest data. Publishers must obtain affirmative consent for the collection of location data and the sharing of such data with GreedyGame.<\/p><ol start=\"3\"><li><strong> Obligations of GG<\/strong><\/li><\/ol><p>3.1. Appointment<\/p><p>GG hereby grants to Publisher the right and license to its proprietary tools to assist with solicitation of Advertising, display of Ads on its Network, monitoring and reporting on displayed Ads.<\/p><p> 3.2. Sales Efforts<\/p><p>GG will (i) use its commercially reasonable efforts to solicit and sell to Advertisers Advertising on the Publisher Networks at prices determined by GG, in its sole discretion (so long as they do not drop below minimum prices set by Publisher in accordance with Section 2.1 above), all in accordance with the rights, licenses and privileges granted to GG in Section 2.1, and (ii) give immediate effect to any decision by Publisher to reject or block any category or domain of Advertising that was rejected in accordance with the provisions in Section 2.1 of this Agreement.<\/p><p>3.3. Reporting<\/p><p>GG will provide daily detailed records to Publisher through a user interface dashboard that will allow Publisher to monitor the content, price and volume of paid Advertising delivered to each of the Networks per Advertisement and all Advertising Sales Revenue associated with Publisher and Publisher’s Networks, provided that such records will be subject to the confidentiality obligations of the Parties set forth in this Agreement.<\/p><p> 3.4. Publisher access for Cross Promotion and Advertisement<\/p><p>GG enables Publishers to serve cross promotion campaigns and serve Advertisements on the Publisher’s Network through its own sales channels. The publisher will have complete control to sell Advertising on its preferred cost model. The services are at no additional cost to a fixed number of Branded Sessions each month post which a charge will be applicable. The numbers for free Branded Sessions and the charges will be communicated to the Publisher via email. GG holds responsibility to notify the Publisher of its monthly free Branded Sessions and of any change in charges.<\/p><ol start=\"4\"><li><strong> Payments<\/strong><\/li><\/ol><p>4.1. Consulting Fees<\/p><p>GG shall pay Publisher a consulting fee (the “fee”) equal to 70% percent of the Net Advertising Sales Revenue for Ads that are solicited by GreedyGame and are run on the Publisher Network. The fee shall be paid to Publisher by GG no later than sixty (60) days after submission of invoice. Such payment shall reflect information displayed in the GG’s Online Interface. This information shall include (i) the fee paid, (ii) the figures supporting such calculation on a per Advertisement basis, including Ad size, Sessions delivered, CPM and fee amounts (iii) kind of Advertising placed (iv) cost of the Advertising campaigns. For wire transfer the minimum fee payout is USD 1,000 or equivalent. For the avoidance of doubt, GG will have the sole responsibility for calculation and reporting of all statistics, including Sessions, leads, sales, and fee amounts.<\/p><p>4.2. Taxes and Costs<\/p><p>For the avoidance of doubt, all prices are in United States Dollars and do not include sales, use, value-added or import taxes, customs duties or similar taxes that may be assessed by any jurisdiction. Taxes will be levied by each Party on the final invoice as per applicable law.<\/p><ol start=\"5\"><li><strong> Conditions<\/strong><\/li><\/ol><p> 5.1. Term and Termination<\/p><p>The term of this Agreement will commence on the date You create a Service account via GreedyGame UI and agree to the terms of this Agreement, and will continue until terminated by either party as provided in this Agreement (the “Term”). Either Party shall have the right, with or without cause, to terminate this Agreement upon thirty (30) days prior written (via email) notice to the other Party. In addition, both Parties shall have the right to terminate this Agreement upon written notice to the other Party and with immediate effect if such Party is in material breach of any provision of this Agreement and has failed to cure such breach within thirty (30) days of a written notice specifying such breach. Upon termination, (i) all rights granted in this Agreement shall terminate automatically, (ii) all terms of this Agreement that by their nature extend beyond the termination of this Agreement shall remain in effect until fulfilled and apply to respective successors and assigns, (iii) each Party will immediately cease using or displaying the intellectual property of the other Party described herein and (iv) each Party shall return or destroy all Confidential Information relating to the other Party then in its possession.<\/p><p> 5.2. Severability<\/p><p>If any provision of the Agreement was declared fully or partially invalid, illegal or unenforceable by any court of competent jurisdiction, the validity, legality or enforceability of other contractual provisions of the Agreement shall not be affected, and the provision or provisions considered null and void shall be replaced within the limits of what is allowed by law by new provisions expressing the intention of the parties<\/p><p>5.3. Representations and Warranties<\/p><p>You represent and warrant that: (a) You possess all necessary skills, knowledge and authority to enter into this Agreement and to fully perform the Services and its obligations hereunder in accordance with the highest industry standards applicable to your profession, (b) You have and will maintain throughout the Term all rights, authorizations and licenses (including without limitation any Intellectual Property Rights) that are required with respect to (i) the Publisher Network, (ii) to display Demand Ads and Publisher Ads on the Publisher Network, (iii) to permit GG to perform the services contemplated under this Agreement and (iv) to grant the rights You grant herein; (c) all of the information provided by You to GG to enroll in any Service is correct, accurate, complete and current at all times; (d) You have complied and will continue to comply with all applicable laws, statutes, ordinances, and regulations (including without limitation any relevant data protection or privacy laws) in Your performance of any acts hereunder, and You will not cause GG to be in violation of any applicable laws; (e) You comply with and have any and all consents, waivers, approvals, authorizations and clearances from End Users to allow GG to collect and use the Service Data in accordance with this Agreement, and as may be required for GG to provide services hereunder; (f) You will at all times comply with GG Policies; (g) Publisher Ads do not now nor will in the future infringe upon or violate any Intellectual Property Rights of any third party, including but not limited to any patent, copyright, trademark, trade secret, or moral right; (h) You are adequately financed to meet any financial obligations it may be required to incur hereunder; (i) as of the Effective Date, there is no pending legal proceeding claiming that Publisher or any of its related entities has infringed upon, misappropriated or otherwise violated any intellectual property right of any third party; and (j) shall conform to and operate in accordance with the specifications set forth herein and any service level agreement.<\/p><p>5.4. Indemnity<\/p><p>GG shall defend, indemnify and hold harmless Publisher and its officers, directors, agents, employees and assigns, and Publisher shall defend, indemnify and hold harmless GG and its officers, directors, agents, employees and assigns, from and against all damages, liabilities, losses, costs and expenses(including reasonable attorneys’ fees) relating to any claim, action, suit or proceeding brought by a third party based on any breach by the indemnifying party of any term of this Agreement or any actual or alleged infringement or misappropriation of such third party’s intellectual property rights in connection with the indemnified party’s authorized use of the indemnifying party’s Systems or Content. The indemnified party shall give the indemnifying party prompt written notice of any such claim and cooperate reasonably with the indemnifying party (at the indemnifying party’s request and expense) in the defense and resolution of such claim. The indemnifying party shall control the defense and resolution of such claim, provided the indemnified party (at its expense and with counsel of its choosing) may participate in the defense and resolution of such claim. Any settlement of such claim shall require the indemnified party’s prior written consent (which shall not be unreasonably withheld).<\/p><p>5.5. Limitation of Liability<\/p><p>GG WILL NOT BE LIABLE TO YOU OR ANY THIRD PARTY HEREUNDER FOR ANY PUNITIVE, INCIDENTAL, INDIRECT, SPECIAL, RELIANCE OR CONSEQUENTIAL DAMAGES, INCLUDING LOST BUSINESS, REVENUE, OR ANTICIPATED PROFITS, WHETHER BASED ON BREACH OF CONTRACT, TORT (INCLUDING NEGLIGENCE), OR OTHERWISE, AND WHETHER OR NOT GG WAS ADVISED OF THE POSSIBILITY OF SUCH LOSS OR DAMAGES. IN NO EVENT WILL GG’S LIABILITY AND DAMAGES, WHETHER BASED ON BREACH OF CONTRACT, TORT (INCLUDING NEGLIGENCE), OR OTHERWISE, ARISING OUT OF OR RELATING TO ANY SERVICE OR THIS AGREEMENT EXCEED $500. THE PARTIES AGREE THAT THE EXISTENCE OF MORE THAN ONE CLAIM SHALL NOT INCREASE THE FOREGOING LIMIT, AND THAT THE LIMITATIONS OF LIABILITY SET FORTH IN THIS SECTION WILL APPLY EVEN IF ANY LIMITED REMEDY SPECIFIED IN THIS AGREEMENT IS FOUND TO HAVE FAILED OF ITS ESSENTIAL PURPOSE.<\/p><p>5.6. Disclaimers<\/p><p>EXCEPT AS EXPRESSLY SET FORTH HEREIN, NEITHER GG NOR ANY GG AFFILIATE MAKES ANY WARRANTY OR REPRESENTATION WHATSOEVER REGARDING GG SERVICES TO BE PROVIDED HEREUNDER AND ACTIONS IN CONNECTION WITH THIS AGREEMENT, THE MINIMUM ADVERTISING SALES REVENUES, AS MEASURED IN ANY WAY, INFORMATION OR SERVICES PROVIDED OR MADE AVAILABLE THROUGH OR IN CONNECTION WITH GG OR ANY GG AFFILIATE. SOME STATES DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES, SO THE ABOVE EXCLUSION MAY NOT APPLY TO PUBLISHER. THIS LIMITED WARRANTY, IF ANY, GIVES PUBLISHER SPECIFIC LEGAL RIGHTS, AND PUBLISHER MAY ALSO HAVE OTHER RIGHTS, WHICH VARY FROM STATE TO STATE.<\/p><p>5.7. Licenses<\/p><p>Publisher hereby grants to GG a non-exclusive, non-transferable, non-sub licensable right and license, during the Term, to access and use Publisher’s Systems and to use Publisher’s Content solely for the purpose of providing the Services to Publisher hereunder. All right, title and interest in and to Publisher’s Systems and Publisher’s Content not specifically licensed to GG hereunder shall be retained by Publisher. Neither Party may remove, modify or obscure any copyright, trademark or other proprietary rights notices on the other Party’s Systems or Content. All goodwill arising out of each Party’s use of the other Party’s Marks as provided herein shall inure to the benefit of the owner of such Marks.<\/p><p>5.8. Force Majeure<\/p><p>Neither party will be responsible for any failure to perform or delay attributable in whole or in part to any cause beyond its reasonable control, including but not limited to Acts of God, government actions, war, civil disturbance, insurrection, sabotage, shortage of energy, raw materials or equipment (“Force Majeure Event”). Provided however, that if a Force Majeure Event occurs, the affected Party shall, as soon as practicable:<\/p><p>(i) Notify the other Party of the happening of the Force Majeure Event and its impact on the performance of the obligations of the affected Party under this Agreement.<\/p><p>(ii) Use all reasonable efforts to resolve any issues resulting from the Force Majeure Event and perform its obligations hereunder.<\/p><ol start=\"6\"><li><strong> Use of Information<\/strong><\/li><\/ol><p>6.1. Confidential Information<\/p><p>Party may, during the performance of its obligations hereunder, have access to and acquire knowledge, materials, data and other information concerning the operation, business plans or opportunities of the other Party or its Affiliates or partners that may not be known to the general public (“Confidential Information”). Each Party shall not use or disclose to any third party any Confidential Information without the other Party’s prior written approval. Each Party shall, and shall cause its employees, agents, and every other party it utilizes to perform Services and obligations hereunder, to sign a confidentiality agreement in substance identical to this Section prior to receipt of any Confidential Information, and protect the Confidential Information from unauthorized use or disclosure with the same degree of care, but no less than reasonable care, as each Party uses to protect its own confidential information of a similar nature. In the event that any Party is directed to disclose any portion of the Confidential Information in conjunction with a judicial proceeding or arbitration, the responsible Party shall immediately notify the affected Party and shall provide reasonable cooperation and assistance in obtaining a suitable protective order and in taking other steps to preserve confidentiality.<\/p><ol start=\"7\"><li><strong> General Provisions<\/strong><\/li><\/ol><p>7.1. The Parties<\/p><p>Publisher and GG expressly agree that they are independent contractors and do not intend for this Agreement to be interpreted as an employment, agency, joint venture or partnership relationship between Publisher and GG. This Agreement and each Party rights, duties and obligations hereunder are personal to Party and may not be assigned, delegated or otherwise transferred by any Party, or by operation of law, without the other Party’s prior written consent. No waiver of any provision of this Agreement shall be effective, except pursuant to a written instrument signed by the Party waiving compliance. Neither Party shall be liable for any failure or delay in its performance under this Agreement due to any event or circumstance beyond its anticipation and control, provided that the Party claiming force majeure gives the other Party prompt notice of such cause and uses its reasonable commercial efforts to promptly correct such failure or delay in performance.<\/p><p>7.2. This Agreement<\/p><p>This Agreement shall be governed by the laws of India and High Courts of Delhi shall have exclusive jurisdiction. If any provision of this Agreement shall be adjudged by a court of competent jurisdiction to be void, such provision shall apply with such modifications as may be necessary to make it valid and effective and the validity, legality and enforceability of the remaining provisions shall not be affected or impaired. This Agreement and all exhibits and schedules attached hereto constitute the entire agreement of the Parties with respect to the subject matter hereof and supersedes all (a) prior written agreements and understandings, (b) prior or contemporaneous oral agreements and understandings, and (c) shrink-wrap or click-through license or Web-posted terms and conditions. This Agreement may not be amended or modified except by a writing signed by the Parties. This Agreement may be executed in counterparts, each of which shall be an original and all of which together shall constitute one and the same instrument. Any notice or other communication required or permitted to be given hereunder shall be given in writing, properly addressed and delivered to the intended recipient and shall be deemed effective upon receipt.<\/p><\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>Terms of Service This GreedyGame Terms of Service (“Agreement”) entered by and between GreedyGame Media Pvt. Ltd. (“GG”), a company incorporated under the Companies Act, 2013 having its registered office at A-486\/487, Indira Gali, Mandavali, Delhi – 110092 and You (“Publisher”), i.e. you or any other person or entity identified in any Service account on [&hellip;]<\/p>\n","protected":false},"author":173546090,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"advanced_seo_description":"","_coblocks_attr":"","_coblocks_dimensions":"","_coblocks_responsive_height":"","_coblocks_accordion_ie_support":"","spay_email":"","_starter_page_template":""},"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.5 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Terms of services - GreedyGame<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/greedygame.com\/terms-of-services\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Terms of services - GreedyGame\" \/>\n<meta property=\"og:description\" content=\"Terms of Service This GreedyGame Terms of Service (“Agreement”) entered by and between GreedyGame Media Pvt. Ltd. (“GG”), a company incorporated under the Companies Act, 2013 having its registered office at A-486\/487, Indira Gali, Mandavali, Delhi – 110092 and You (“Publisher”), i.e. you or any other person or entity identified in any Service account on [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/greedygame.com\/terms-of-services\/\" \/>\n<meta property=\"og:site_name\" content=\"GreedyGame\" \/>\n<meta property=\"article:modified_time\" content=\"2019-11-26T11:31:52+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"15 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/greedygame.com\/#website\",\"url\":\"https:\/\/greedygame.com\/\",\"name\":\"GreedyGame\",\"description\":\"Automation Tool for Admob\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/greedygame.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/greedygame.com\/terms-of-services\/#webpage\",\"url\":\"https:\/\/greedygame.com\/terms-of-services\/\",\"name\":\"Terms of services - GreedyGame\",\"isPartOf\":{\"@id\":\"https:\/\/greedygame.com\/#website\"},\"datePublished\":\"2019-11-04T11:38:19+00:00\",\"dateModified\":\"2019-11-26T11:31:52+00:00\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/greedygame.com\/terms-of-services\/\"]}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_shortlink":"https:\/\/wp.me\/Pbnzzl-ij","_links":{"self":[{"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/pages\/1135"}],"collection":[{"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/users\/173546090"}],"replies":[{"embeddable":true,"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/comments?post=1135"}],"version-history":[{"count":7,"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/pages\/1135\/revisions"}],"predecessor-version":[{"id":6743,"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/pages\/1135\/revisions\/6743"}],"wp:attachment":[{"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/media?parent=1135"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}