{"id":3956,"date":"2019-11-14T12:59:08","date_gmt":"2019-11-14T07:29:08","guid":{"rendered":"https:\/\/greedygame.com\/?page_id=3956"},"modified":"2020-05-11T00:18:13","modified_gmt":"2020-05-10T18:48:13","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/greedygame.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"<h3 class=\"font_8\">Overview<\/h3>\n<p class=\"font_8\">GreedyGame Media Private Limited provides advertising technology services including its mobile advertising exchange, the GreedyGame website, and the GreedyGame SDKs and APIs. Our Services allow publishers of mobile applications (“apps”) to show ads on their sites and apps, and advertisers to reach audiences that may be interested in their products or services. This Privacy Policy explains how GreedyGame collects and uses information about users of GreedyGame apps, publisher and advertiser customers that use the GreedyGame services, and end users of apps and sites that use the GreedyGame Services.<\/p>\n<p class=\"font_8\">Section 1 describes how GreedyGame collects and uses information from end users in providing the GreedyGame Services; Section 2 describes how GreedyGame collects and uses information about GreedyGame Customers and the information GreedyGame collects when an individual uses the GreedyGame website; and Section 3 contains information about our privacy practices that apply to both the information we collect from end users through the GreedyGame Services and the information we collect from GreedyGame Customers and users of our website.<\/p>\n<p class=\"font_8\">&nbsp;<\/p>\n<h2 class=\"font_8\"><strong>Section 1: End User Information<\/strong><\/h2>\n<h3 class=\"font_8\">The Information We Collect<\/h3>\n<p class=\"font_8\">When you interact with an app that uses the GreedyGame Services, we may collect information about your device and the ads you view or click. The GreedyGame Services are designed to avoid collecting information that identifies you personally, such as your name, address, or email address, but the information we collect does enable us to recognize your device over time. The information we collect includes, but is not limited to:<\/p>\n<p class=\"font_8\">Information about your device, such as the type and model, manufacturer, operating system (e.g. iOS or Android), carrier name, IP address, mobile browser (e.g. Chrome, Safari), applications using the GreedyGame Services and the version of such applications, and identifiers assigned to your device, such as its iOS Identifier for Advertising (IDFA), Android Advertising ID, or unique device identifier (a number uniquely allocated to your device by your device manufacturer).Log information, including the app or website visited, session start\/stop time, time zone, and network connection type (e.g., WiFi, cellular), and cookie information.<\/p>\n<p class=\"font_8\">The geo-location of your device (using GPS or other geo-location data), when location services have been enabled for the mobile app or website that uses the GreedyGame Services.<\/p>\n<p class=\"font_8\">Information about ads served, viewed, or clicked on, such as the type of ad, where the ad was served, whether you clicked on it, and whether you visited the advertiser’s website or purchased the product or service advertised.<\/p>\n<p class=\"font_8\">Information that GreedyGame Customers and other third parties have collected and share with GreedyGame, such as information about activity in their services. This may include the content you view or searches you made, the language you prefer, or other non-personally identifying demographic or interest information, to help make the ads served to you more relevant.<\/p>\n<p>&nbsp;<\/p>\n<h3 class=\"font_8\">How We Use the Information We Collect<\/h3>\n<p class=\"font_8\">We use the information we collect to provide and improve GreedyGame Services, as well as to enable and allow for the improvement of related services provided by GreedyGame Customers or other third party partners in connection with the GreedyGame Services and across the broader advertising ecosystem, including for the following purposes:<\/p>\n<p class=\"font_8\">Serving ads: Allowing publishers to offer advertising inventory in their mobile apps, and advertisers to bid on and fill that inventory.<\/p>\n<p class=\"font_8\">Ad Reporting and Conversions: Reporting to advertisers information about when and how users have been exposed to their ads, clicked on their ads, or visit their website, and reporting to publishers information about when and how ads were shown on their properties and were clicked on.<\/p>\n<p class=\"font_8\">Frequency Capping: Preventing users from seeing the same ad too many times.<\/p>\n<p class=\"font_8\">Fraud Detection and Prevention: Identifying invalid clicks (or ad queries) and protecting GreedyGame and GreedyGame Customers from fraudulent behaviour.<\/p>\n<p class=\"font_8\">Interest-Based Advertising: Allowing GreedyGame and GreedyGame Customers to infer interests and serve ads to users based on their activity and inferred interests.<\/p>\n<p class=\"font_8\">Geo-Targeting: Where permitted by the user’s device, allowing GreedyGame and GreedyGame Customers to serve ads based on a user’s location.<\/p>\n<p class=\"font_8\">Providing and Improving Our Services: Auditing, researching, and analyzing data in order to maintain, protect, and improve our Services and develop new services, and to ensure that our technologies function properly.<\/p>\n<p class=\"font_8\">GreedyGame will not combine the non-personally identifiable information collected to provide the GreedyGame Services with your personally-identifying information without your express consent.<\/p>\n<p class=\"font_8\">&nbsp;<\/p>\n<h3 class=\"font_8\">How We Share the Information We Collect<\/h3>\n<p class=\"font_8\">We share the information we collect to provide and improve GreedyGame Services, as well as to enable and allow for the improvement of related services provided by GreedyGame Customers or other third party partners in connection with the GreedyGame Services and across the broader advertising ecosystem, as follows:<\/p>\n<p class=\"font_8\">We share with advertiser customers information so that they can decide whether to bid on ad inventory or serve an advertisement and choose the best ad for that user on our mobile advertising exchange and across the broader advertising ecosystem. GreedyGame Customers are obligated to use the information they receive in compliance with applicable laws and regulations.<\/p>\n<p class=\"font_8\">We share aggregate or non-personally identifiable information about the use of our Services with GreedyGame Customers. For example, we provide advertisers reports showing how many users viewed or clicked on their ads. We also provide publishers reports about the types of ads served to their apps.<\/p>\n<p class=\"font_8\">We share with partners who help with anti-fraud, quality, and security efforts to ensure the safety, security, privacy, and accuracy of the GreedyGame Services and the broader advertising ecosystem.<\/p>\n<p class=\"font_8\">We share with data partners who help GreedyGame Customers to improve the performance of their bids or inventory on our mobile advertising exchange and across the broader advertising ecosystem.<\/p>\n<p class=\"font_8\">We share information within our corporate family to provide, understand, or improve their or our services.<\/p>\n<p class=\"font_8\">We also share information as described in Section 3 of this privacy policy.<\/p>\n<h3 class=\"font_8\">\nPrivacy Practices of GreedyGame Customers<\/h3>\n<p class=\"font_8\">GreedyGame requires GreedyGame Customers to comply with all applicable laws and regulations and to provide end users with notice of the collection of data for advertising purposes as outlined in this Privacy Policy. We encourage all users to review the privacy policies of sites and apps they visit for information about those sites’ and apps’ data collection and use practices.<\/p>\n<p class=\"font_8\">&nbsp;<\/p>\n<h2 class=\"font_8\">Section 2: Data Collected from GreedyGame Customers and on GreedyGame’s Website<\/h2>\n<h3 class=\"font_8\">\nPersonal Information<\/h3>\n<p class=\"font_8\">To become a GreedyGame Customer, you may be asked to provide certain personal information, including your name, email address, physical address, phone number, and company name. You also may be asked to provide personal information in certain fields on this website. Registration information is used to provide the GreedyGame Services and to send promotional information about the GreedyGame Services. To opt out of receiving promotional information, please follow the unsubscribe instructions in any of our promotional emails. If you are a registered user of our Services, we provide you with account tools to access, correct, or modify personal information you have provided to us in association with your account.<\/p>\n<p class=\"font_8\">&nbsp;<\/p>\n<h3 class=\"font_8\">Web Log Information<\/h3>\n<p class=\"font_8\">When you visit our websites, our servers automatically record certain information in our log files. This web log information includes your IP address, browser type, operating system, the referring web page, pages visited, and cookie information. Like many websites, we use web log information, along with cookies, pixels, and similar technologies, to operate our websites, better understand how they are used, resolve technical problems, and enhance your experience on our sites.<\/p>\n<p class=\"font_8\">Cookies are small files that websites place on your computer as you browse the web. A pixel is a small amount of code on a web page and is often used in connection with cookies. Most web browsers automatically accept cookies. You can instruct your browser, by changing its settings, to stop accepting cookies or to prompt you before accepting a cookie from the websites you visit. However, some sites may not function properly if you disable cookies.<\/p>\n<p class=\"font_8\">&nbsp;<\/p>\n<h3 class=\"font_8\">Information Sharing and Disclosure<\/h3>\n<p class=\"font_8\">We may disclose information about GreedyGame Customers when necessary to provide the GreedyGame Services to them, such as for account inquiries or verification, or to enable participation in certain features of our mobile advertising exchange. We may also share information within our corporate family to provide, understand, or improve their or our services, and as described in Section 3 of this privacy policy.<\/p>\n<p class=\"font_8\">&nbsp;<\/p>\n<h2 class=\"font_8\">Section 3: General Information<\/h2>\n<h3 class=\"font_8\">\nInformation Sharing and Disclosure<\/h3>\n<p class=\"font_8\">We engage service providers to perform functions and provide services to us and our GreedyGame Customers globally. We may share the information we collect with such service providers subject to obligations consistent with this Privacy Policy and any other appropriate confidentiality and security measures, and on the condition that the third parties use your information only on our behalf and pursuant to our instructions.<\/p>\n<p class=\"font_8\">Notwithstanding anything to the contrary in this Privacy Policy, we may preserve or disclose information if we believe that it is reasonably necessary to comply with a law, regulation, legal process, or governmental request; to protect the safety of any person; to address fraud, security or technical issues; or to protect the rights or property of GreedyGame, GreedyGame Customers, users of our website, or end users.<\/p>\n<p class=\"font_8\">We may also share information when we have your consent to do so, or when a member of our corporate family has received your consent to do so.<\/p>\n<p class=\"font_8\">&nbsp;<\/p>\n<h3 class=\"font_8\">Information Provided by Third Parties<\/h3>\n<p class=\"font_8\">We may receive information about you from third parties, including GreedyGame Customers, data partners, and our corporate family. This information may include, for example, browser cookie IDs, mobile device IDs, demographic or interest data, and content viewed or actions taken on a website or app.<\/p>\n<p class=\"font_8\">&nbsp;<\/p>\n<h3 class=\"font_8\">Information Collected by Others<\/h3>\n<p class=\"font_8\">Please be advised that we do not control and are not responsible for the privacy practices of any third party, including, but not limited to, GreedyGame Customers and any website or service that links to or from our website or the GreedyGame Services. We cannot control the actions of GreedyGame Customers, so please be sure to review the privacy policies of any websites and applications that you may use. This site may contain links to other sites. GreedyGame is not responsible for the privacy practices or content of these other sites. When you leave our site or view a portion of a third party’s site through our site, we encourage you to read the privacy policies of each such site. This Privacy Policy applies solely to information collected by GreedyGame.<\/p>\n<p class=\"font_8\">&nbsp;<\/p>\n<h3 class=\"font_8\">Confidentiality and Security<\/h3>\n<p class=\"font_8\">GreedyGame has implemented reasonable security measures in order to protect both personal and non-personal information from loss, misuse and unauthorized access, disclosure, alteration or destruction.<\/p>\n<p class=\"font_8\">&nbsp;<\/p>\n<h3 class=\"font_8\">Changes to This Privacy Policy<\/h3>\n<p class=\"font_8\">We may amend this privacy policy from time to time. If we make a change to this policy that, in our sole discretion, is material, we will notify you by posting notice of these changes on our website home page and in this Privacy Policy.<\/p>\n<p class=\"font_8\">&nbsp;<\/p>\n<h3 class=\"font_8\">Changes in Corporate Structure<\/h3>\n<p class=\"font_8\">In the event that GreedyGame is involved in a bankruptcy, merger, acquisition, reorganization or sale of assets, your information may be sold or transferred as part of that transaction. The promises in this Privacy Policy will apply to your information as transferred to the new entity.<\/p>\n<p class=\"font_8\">&nbsp;<\/p>\n<h3 class=\"font_8\">Consent to Data Processing and Transfer<\/h3>\n<p class=\"font_8\">When you use or interact with any of the GreedyGame Services, including by using applications that have integrated the GreedyGame Services, you consent to the collection, transfer, manipulation, storage, disclosure and other uses of your information as described in this Privacy Policy. This includes any information you choose to provide that is deemed sensitive under applicable law.<\/p>\n<p class=\"font_8\">Irrespective of which country you live in, you authorize us to use your information in, and as a result to transfer it to and store it in any other country where we, our service providers, and our GreedyGame Customers operate. Privacy and data protection laws in some of these countries may vary from the laws in the country where you live.<\/p>\n<p class=\"font_8\">This document provides a general overview of the steps taken by GreedyGame to meet its regulatory requirements under the GDPR.<\/p>\n<p class=\"font_8\">&nbsp;<\/p>\n<h3 class=\"font_8\">What is GreedyGame Doing?<\/h3>\n<p class=\"font_8\">GreedyGame is taking diligent steps to ensure that its data protection practices are aligned with industry best practices, as well as the requirements of the GDPR, such as:<\/p>\n<p class=\"font_8\">We are putting effective policies and procedures in place to ensure that our data processing activities are adequately documented.<\/p>\n<p class=\"font_8\">We are carrying out a comprehensive review of our privacy notices and putting a plan in place for making necessary changes in time for GDPR implementation.<\/p>\n<p class=\"font_8\">We review our procedures to ensure that they cover all the rights of individuals (i.e. right of access, right to erasure and right to object), within the new timescales.<\/p>\n<p class=\"font_8\">We review and affirm the lawful basis for our data processing activities under the GDPR.<\/p>\n<p class=\"font_8\">We are carrying out a comprehensive review of our information security practices, adopting various technical, organizational and physical measures to ensure that personal data is adequately safeguarded.<\/p>\n<p class=\"font_8\">We have initiated various steps to ensure that decision-makers and key personnel at GreedyGame are aware of the new changes under the GDPR, and are actively working towards raising its awareness.<\/p>\n<p class=\"font_8\">GreedyGame is taking steps to certify with the European Interactive Digital Advertising Alliance (EDAA), the leading cross-industry self-regulatory initiative for enhancing transparency and user control over online behavioural advertising.<\/p>\n<p class=\"font_8\"><span class=\"wixGuard\">​<\/span><\/p>\n<h3 class=\"font_6\">COPPA<\/h3>\n<p class=\"font_8\">Publisher Partners using the GreedyGame service must comply with the Children’s Online Privacy Protection Act (“COPPA”) in the collection and use of “Personal Information” (as defined by COPPA) from children under 13 years old, meaning 12 years and younger.<\/p>\n<p class=\"font_8\">GreedyGame is committed to respecting and protecting individuals&#8217; privacy rights and complying with all applicable laws and regulations. GreedyGame ensures that we do not collect and use information from children’s sites for behavioral advertising (often referred to as interest based advertising). We will continue to only use any data in the manner that COPPA prescribes.<\/p>\n<p class=\"font_8\">We have identified all existing publisher sites and apps directed to children to ensure we are in full compliance with the new COPPA rules and shall ensure that new and existing publishers are required to notify GreedyGame&nbsp;of any new sites or app accounts that are directed at children to ensure we continue to comply with the COPPA rules.<\/p>\n<p class=\"font_8\"><span class=\"wixGuard\">​<\/span>​<\/p>\n<h3 class=\"font_8\">Contact Us<\/h3>\n<p class=\"font_8\">If you have questions about this policy, or inquiries or requests regarding your information, please contact us at info@greedygame.com.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Overview GreedyGame Media Private Limited provides advertising technology services including its mobile advertising exchange, the GreedyGame website, and the GreedyGame SDKs and APIs. Our Services allow publishers of mobile applications (“apps”) to show ads on their sites and apps, and advertisers to reach audiences that may be interested in their products or services. This Privacy [&hellip;]<\/p>\n","protected":false},"author":173546090,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"advanced_seo_description":"","_coblocks_attr":"","_coblocks_dimensions":"","_coblocks_responsive_height":"","_coblocks_accordion_ie_support":"","spay_email":"","_starter_page_template":""},"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v15.5 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Privacy Policy - GreedyGame<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/greedygame.com\/privacy-policy\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Privacy Policy - GreedyGame\" \/>\n<meta property=\"og:description\" content=\"Overview GreedyGame Media Private Limited provides advertising technology services including its mobile advertising exchange, the GreedyGame website, and the GreedyGame SDKs and APIs. Our Services allow publishers of mobile applications (“apps”) to show ads on their sites and apps, and advertisers to reach audiences that may be interested in their products or services. This Privacy [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/greedygame.com\/privacy-policy\/\" \/>\n<meta property=\"og:site_name\" content=\"GreedyGame\" \/>\n<meta property=\"article:modified_time\" content=\"2020-05-10T18:48:13+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"10 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/greedygame.com\/#website\",\"url\":\"https:\/\/greedygame.com\/\",\"name\":\"GreedyGame\",\"description\":\"Automation Tool for Admob\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/greedygame.com\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/greedygame.com\/privacy-policy\/#webpage\",\"url\":\"https:\/\/greedygame.com\/privacy-policy\/\",\"name\":\"Privacy Policy - GreedyGame\",\"isPartOf\":{\"@id\":\"https:\/\/greedygame.com\/#website\"},\"datePublished\":\"2019-11-14T07:29:08+00:00\",\"dateModified\":\"2020-05-10T18:48:13+00:00\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/greedygame.com\/privacy-policy\/\"]}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","jetpack_shortlink":"https:\/\/wp.me\/Pbnzzl-11O","_links":{"self":[{"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/pages\/3956"}],"collection":[{"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/users\/173546090"}],"replies":[{"embeddable":true,"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/comments?post=3956"}],"version-history":[{"count":2,"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/pages\/3956\/revisions"}],"predecessor-version":[{"id":5257,"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/pages\/3956\/revisions\/5257"}],"wp:attachment":[{"href":"https:\/\/greedygame.com\/wp-json\/wp\/v2\/media?parent=3956"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}